# PromptForFamilyInstancePlacementOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PromptForFamilyInstancePlacementOptions Class
Members See Also
---
This class contains options to control the behavior of interactive placement of family instances.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class PromptForFamilyInstancePlacementOptions : IDisposable
```

Visual Basic
---
```text
Public Class PromptForFamilyInstancePlacementOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class PromptForFamilyInstancePlacementOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..PromptForFamilyInstancePlacementOptions
# See Also
PromptForFamilyInstancePlacementOptions Members
Autodesk.Revit.UI Namespace